; domain
(define (domain cell-assembly-cost)
  (:requirements :strips :typing
		 :negative-preconditions
		 :action-costs)
  (:types arm		       ;
	  position	       ; Where the arms is potentially able to go
	  holdable
	  job - object
	  
	  table - position     ; The place to attach components with arms.
	  container - position ; Has infinite capacity to store things.
	  
	  conveyor - container ; Slide things in/away. Infinite length.
	  tray - container     ; Part trays.
	  
	  machine - table      ; Tables which does specific jobs by itself.
	  machine-job - job    ; Jobs which should be done on machines.
	  base - holdable      ;
	  component - holdable ; Things which should be attatched on tables.
	  )
  (:constants carry-in - conveyor  ; the start of the base
	      carry-out - conveyor ; the goal of the base
	      table-in - table	   ; always connected to the conveyor
	      table-out - table	   ; always connected to the conveyor
	      nothing-done - job)  ; general start state of any base
  (:predicates 

   ;; arm attributes
   (reachable ?arm - arm ?to - position)
   ;; position attributes
   (adjacent ?from ?to - position)
   (connected ?from ?to - position) ;; by conveyor
   ;; job attributes
   (depends ?prev-job ?job - job)
   (job-available-at ?job - job ?pos - table)
   (uses ?job - job ?component - component)
   
   ;; state description
   (at ?obj - object ?pos - position)
   (arm-present ?pos - position)
   (base-present ?pos - position)
   
   (hold ?arm - arm ?holdable - holdable)
   (free ?arm - arm) ;; instead of (not (exists (?base) (hold ?arm ?base)))

   ;; (used ?component - component)
   
   (finished ?job - job ?base - base))

  (:functions
   (total-cost)
   (loading-cost)        ; the cost to set and eject base
   (job-cost ?job - job) ; the cost to do each job
   
   ;; slidng bases costs nothing

   (move-cost ?from ?to - position) - number)

  (:action move-arm
	   ;;   Moves the arm (?arm) from the source
	   ;; (?from) to the destination (?to). The occupied and not-
	   ;; occupied propositions enforce a mutual exclusion con-
	   ;; straint so that only one arm can occupy any given location
	   ;; at a time.
	   :parameters (?arm - arm ?from - position ?to - position)
	   :precondition (and (adjacent ?from ?to)
			      (at ?arm ?from)
			      (not (arm-present ?to))
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  
  (:action eject-base
	   ;; Eject Base: Uses an arm (?arm) to grasp and pick up a
	   ;; base (?base) from a machine or a table (?pos). Resets
	   ;; the mutual exclusion constraint enforcing the rule that
	   ;; at most 1 base can be at a location (notbaseplaced ?pos)
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (at ?base ?pos)
			      (at ?arm ?pos)
			      (free ?arm))
	   :effect (and (hold ?arm ?base)
			(not (free ?arm))
			(not (base-present ?pos))
			(not (at ?base ?pos))
			(increase (total-cost) (loading-cost))))
  
  (:action set-base
	   ;; Set Base: Commands an arm (?arm) that is holding
	   ;; a particular base (?base) to set the base on a machine
	   ;; or table (?pos). Each machine/table has a mutual
	   ;; exclusion constraint ensuring at most 1 base is placed
	   ;; on it (notbaseplaced).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (hold ?arm ?base)
			      (at ?arm ?pos)
			      (not (base-present ?pos)))
	   :effect (and (at ?base ?pos)
			(free ?arm)
			(not (hold ?arm ?base))
			(base-present ?pos)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-in
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-IN device only.
	   ;; MOD : It DOES care if the destination is already used.
	   :parameters (?base - base ?from - conveyor ?to - table)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to)
			      (not (base-present ?to)))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(base-present ?to)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-out
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-OUT device only.
	   ;; MOD : It doesn't care if the destination is already used.
	   ;; MOD : After the action the base acts like it had disappeard.
	   :parameters (?base - base ?from - table ?to - conveyor)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(not (base-present ?from))
			(increase (total-cost) (loading-cost))))
  
  (:action pickup-component
	   ;; Pick Parts by Arm: Use an arm (?arm) to pick up a part
	   ;; (?part). The part will later be used by a BaseAssem-
	   ;; blePickedPartsXByArm action (see below).
	   ;; 
	   ;; NOTE: basically, we assume there are unlimited number of
	   ;; components in trays. That's why this action lacks the
	   ;; delete effect on the place of the component.
	   :parameters (?component - component ?arm - arm ?pos - tray)
	   :precondition (and (free ?arm)
			      (at ?arm ?pos)
			      (at ?component ?pos))
	   :effect (and (hold ?arm ?component)
			(not (free ?arm))
			(increase (total-cost) (loading-cost))))
  
  (:action assemble-with-machine
	   ;; Base Assemble by Machine: Use a machine (?pos) to
	   ;; perform an assembly operation (e.g., tighten the screw) on
	   ;; a base (?base).

	   ;; The ordering constraints which are determined when the
	   ;; object is designed are encoded as a set of ordering proposi-
	   ;; tions, finished_Step_X and unfihished_Step_X, which rep-
	   ;; resent whether an assembly step X has been performed
	   ;; already.
	   :parameters (?base - base
			?machine - machine
			?job - machine-job
			?prev-job - job)
	   :precondition (and ;; machine specification
			  (job-available-at ?job ?machine)
			  ;; state specification
			  (not (finished ?job ?base))
			  (at ?base ?machine)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(increase (total-cost) (job-cost ?job))))

  (:action assemble-with-arm
	   ;; Base Assemble Picked Parts by Arm: Uses an arm
	   ;; (?arm) to attach a part (?part) to a base.
	   ;; 
	   ;; NOTE: components are not distinguished between each
	   ;;       other
	   :parameters (?component - component
			?job ?prev-job - job
			?base - base
			?arm - arm
			?pos - table)
	   :precondition (and
			  ;; job specification
			  (job-available-at ?job ?pos)
			  (uses ?job ?component)
			  ;; state specification
			  (hold ?arm ?component)
			  (at ?arm ?pos)
			  (at ?base ?pos)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(free ?arm)
			(not (hold ?arm ?component))
			(increase (total-cost) (job-cost ?job)))))

; problem
(DEFINE (PROBLEM CELL-ASSEMBLY-MODEL2B-P-1) (:DOMAIN CELL-ASSEMBLY-COST)
 (:OBJECTS ARM - ARM B-0 - BASE PART-A PART-B PART-C - COMPONENT TRAY-A TRAY-B
  TRAY-C - TRAY TABLE1 - TABLE SCREW-MACHINE-A SCREW-MACHINE-C - MACHINE
  ATTATCH-A - JOB SCREW-A - MACHINE-JOB ATTATCH-B - JOB ATTATCH-C - JOB SCREW-C
  - MACHINE-JOB)
 (:INIT (= (TOTAL-COST) 0) (= (LOADING-COST) 1) (REACHABLE ARM SCREW-MACHINE-C)
  (REACHABLE ARM SCREW-MACHINE-A) (REACHABLE ARM TABLE-IN)
  (REACHABLE ARM TABLE-OUT) (REACHABLE ARM TABLE1) (REACHABLE ARM TRAY-A)
  (REACHABLE ARM TRAY-B) (REACHABLE ARM TRAY-C)
  (= (MOVE-COST TABLE1 SCREW-MACHINE-A) 1)
  (= (MOVE-COST SCREW-MACHINE-A TABLE1) 1) (ADJACENT TABLE1 SCREW-MACHINE-A)
  (ADJACENT SCREW-MACHINE-A TABLE1) (= (MOVE-COST TABLE1 TABLE-IN) 1)
  (= (MOVE-COST TABLE-IN TABLE1) 1) (ADJACENT TABLE1 TABLE-IN)
  (ADJACENT TABLE-IN TABLE1) (= (MOVE-COST SCREW-MACHINE-A TRAY-A) 1)
  (= (MOVE-COST TRAY-A SCREW-MACHINE-A) 1) (ADJACENT SCREW-MACHINE-A TRAY-A)
  (ADJACENT TRAY-A SCREW-MACHINE-A) (= (MOVE-COST TRAY-A TRAY-B) 1)
  (= (MOVE-COST TRAY-B TRAY-A) 1) (ADJACENT TRAY-A TRAY-B)
  (ADJACENT TRAY-B TRAY-A) (= (MOVE-COST TRAY-B TRAY-C) 1)
  (= (MOVE-COST TRAY-C TRAY-B) 1) (ADJACENT TRAY-B TRAY-C)
  (ADJACENT TRAY-C TRAY-B) (= (MOVE-COST TRAY-C SCREW-MACHINE-C) 1)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-C) 1) (ADJACENT TRAY-C SCREW-MACHINE-C)
  (ADJACENT SCREW-MACHINE-C TRAY-C) (= (MOVE-COST SCREW-MACHINE-C TABLE-OUT) 1)
  (= (MOVE-COST TABLE-OUT SCREW-MACHINE-C) 1)
  (ADJACENT SCREW-MACHINE-C TABLE-OUT) (ADJACENT TABLE-OUT SCREW-MACHINE-C)
  (= (MOVE-COST TABLE-OUT TABLE-IN) 1) (= (MOVE-COST TABLE-IN TABLE-OUT) 1)
  (ADJACENT TABLE-OUT TABLE-IN) (ADJACENT TABLE-IN TABLE-OUT)
  (= (MOVE-COST TABLE1 TRAY-A) 1000) (= (MOVE-COST TRAY-A TABLE1) 1000)
  (= (MOVE-COST TABLE1 TRAY-B) 1000) (= (MOVE-COST TRAY-B TABLE1) 1000)
  (= (MOVE-COST TABLE1 TRAY-C) 1000) (= (MOVE-COST TRAY-C TABLE1) 1000)
  (= (MOVE-COST TABLE1 SCREW-MACHINE-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C TABLE1) 1000)
  (= (MOVE-COST TABLE1 TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT TABLE1) 1000)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-B) 1000)
  (= (MOVE-COST TRAY-B SCREW-MACHINE-A) 1000)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-C) 1000)
  (= (MOVE-COST TRAY-C SCREW-MACHINE-A) 1000)
  (= (MOVE-COST SCREW-MACHINE-A SCREW-MACHINE-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C SCREW-MACHINE-A) 1000)
  (= (MOVE-COST SCREW-MACHINE-A TABLE-OUT) 1000)
  (= (MOVE-COST TABLE-OUT SCREW-MACHINE-A) 1000)
  (= (MOVE-COST SCREW-MACHINE-A TABLE-IN) 1000)
  (= (MOVE-COST TABLE-IN SCREW-MACHINE-A) 1000)
  (= (MOVE-COST TRAY-A TRAY-C) 1000) (= (MOVE-COST TRAY-C TRAY-A) 1000)
  (= (MOVE-COST TRAY-A SCREW-MACHINE-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-A) 1000)
  (= (MOVE-COST TRAY-A TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT TRAY-A) 1000)
  (= (MOVE-COST TRAY-A TABLE-IN) 1000) (= (MOVE-COST TABLE-IN TRAY-A) 1000)
  (= (MOVE-COST TRAY-B SCREW-MACHINE-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-B) 1000)
  (= (MOVE-COST TRAY-B TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT TRAY-B) 1000)
  (= (MOVE-COST TRAY-B TABLE-IN) 1000) (= (MOVE-COST TABLE-IN TRAY-B) 1000)
  (= (MOVE-COST TRAY-C TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT TRAY-C) 1000)
  (= (MOVE-COST TRAY-C TABLE-IN) 1000) (= (MOVE-COST TABLE-IN TRAY-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C TABLE-IN) 1000)
  (= (MOVE-COST TABLE-IN SCREW-MACHINE-C) 1000)
  (= (MOVE-COST TABLE1 TABLE1) 1000)
  (= (MOVE-COST SCREW-MACHINE-A SCREW-MACHINE-A) 1000)
  (= (MOVE-COST TRAY-A TRAY-A) 1000) (= (MOVE-COST TRAY-B TRAY-B) 1000)
  (= (MOVE-COST TRAY-C TRAY-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C SCREW-MACHINE-C) 1000)
  (= (MOVE-COST TABLE-OUT TABLE-OUT) 1000)
  (= (MOVE-COST TABLE-IN TABLE-IN) 1000) (CONNECTED CARRY-IN TABLE-IN)
  (CONNECTED TABLE-OUT CARRY-OUT) (= (JOB-COST SCREW-C) 3)
  (DEPENDS ATTATCH-C SCREW-C) (JOB-AVAILABLE-AT SCREW-C SCREW-MACHINE-C)
  (AT PART-C TRAY-C) (USES ATTATCH-C PART-C) (= (JOB-COST ATTATCH-C) 2)
  (DEPENDS ATTATCH-B ATTATCH-C) (JOB-AVAILABLE-AT ATTATCH-C TABLE1)
  (AT PART-B TRAY-B) (USES ATTATCH-B PART-B) (= (JOB-COST ATTATCH-B) 3)
  (DEPENDS SCREW-A ATTATCH-B) (JOB-AVAILABLE-AT ATTATCH-B TABLE1)
  (= (JOB-COST SCREW-A) 3) (DEPENDS ATTATCH-A SCREW-A)
  (JOB-AVAILABLE-AT SCREW-A SCREW-MACHINE-A) (AT PART-A TRAY-A)
  (USES ATTATCH-A PART-A) (= (JOB-COST ATTATCH-A) 2)
  (DEPENDS NOTHING-DONE ATTATCH-A) (JOB-AVAILABLE-AT ATTATCH-A TABLE-IN)
  (= (JOB-COST NOTHING-DONE) 0) (AT B-0 CARRY-IN) (FINISHED NOTHING-DONE B-0)
  (FREE ARM) (AT ARM TABLE-IN) (ARM-PRESENT TABLE-IN))
 (:GOAL (AND (AT B-0 CARRY-OUT) (FINISHED SCREW-C B-0)))
 (:METRIC MINIMIZE (TOTAL-COST)))

; plan
1. (slide-base-in b-0 carry-in table-in)
   deleted: (at b-0 carry-in)
   added: (at b-0 table-in) (base-present table-in)
   goals met: 0 of 2
2. (move-arm arm table-in table1)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 2
3. (move-arm arm table1 screw-machine-a)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 2
4. (move-arm arm screw-machine-a tray-a)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 2
5. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a)
   goals met: 0 of 2
6. (move-arm arm tray-a screw-machine-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 2
7. (move-arm arm screw-machine-a table1)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 2
8. (move-arm arm table1 table-in)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 2
9. (assemble-with-arm part-a attatch-a nothing-done b-0 arm table-in)
   deleted: (hold arm part-a)
   added: (finished attatch-a b-0) (free arm)
   goals met: 0 of 2
10. (eject-base b-0 arm table-in)
   deleted: (free arm) (base-present table-in) (at b-0 table-in)
   added: (hold arm b-0)
   goals met: 0 of 2
11. (move-arm arm table-in table1)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 2
12. (move-arm arm table1 screw-machine-a)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 2
13. (set-base b-0 arm screw-machine-a)
   deleted: (hold arm b-0)
   added: (at b-0 screw-machine-a) (free arm) (base-present screw-machine-a)
   goals met: 0 of 2
14. (assemble-with-machine b-0 screw-machine-a screw-a attatch-a)
   added: (finished screw-a b-0)
   goals met: 0 of 2
15. (eject-base b-0 arm screw-machine-a)
   deleted: (free arm) (base-present screw-machine-a) (at b-0 screw-machine-a)
   added: (hold arm b-0)
   goals met: 0 of 2
16. (move-arm arm screw-machine-a table1)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 2
17. (set-base b-0 arm table1)
   deleted: (hold arm b-0)
   added: (at b-0 table1) (free arm) (base-present table1)
   goals met: 0 of 2
18. (move-arm arm table1 screw-machine-a)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 2
19. (move-arm arm screw-machine-a tray-a)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 2
20. (move-arm arm tray-a tray-b)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 0 of 2
21. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b)
   goals met: 0 of 2
22. (move-arm arm tray-b tray-a)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 2
23. (move-arm arm tray-a screw-machine-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 2
24. (move-arm arm screw-machine-a table1)
   deleted: (at arm screw-machine-a) (arm-present screw-machine-a)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 2
25. (assemble-with-arm part-b attatch-b screw-a b-0 arm table1)
   deleted: (hold arm part-b)
   added: (finished attatch-b b-0) (free arm)
   goals met: 0 of 2
26. (move-arm arm table1 table-in)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 2
27. (move-arm arm table-in table-out)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm table-out) (arm-present table-out)
   goals met: 0 of 2
28. (move-arm arm table-out screw-machine-c)
   deleted: (at arm table-out) (arm-present table-out)
   added: (at arm screw-machine-c) (arm-present screw-machine-c)
   goals met: 0 of 2
29. (move-arm arm screw-machine-c tray-c)
   deleted: (at arm screw-machine-c) (arm-present screw-machine-c)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 0 of 2
30. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c)
   goals met: 0 of 2
31. (move-arm arm tray-c screw-machine-c)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm screw-machine-c) (arm-present screw-machine-c)
   goals met: 0 of 2
32. (move-arm arm screw-machine-c table-out)
   deleted: (at arm screw-machine-c) (arm-present screw-machine-c)
   added: (at arm table-out) (arm-present table-out)
   goals met: 0 of 2
33. (move-arm arm table-out table-in)
   deleted: (at arm table-out) (arm-present table-out)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 2
34. (move-arm arm table-in table1)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm table1) (arm-present table1)
   goals met: 0 of 2
35. (assemble-with-arm part-c attatch-c attatch-b b-0 arm table1)
   deleted: (hold arm part-c)
   added: (finished attatch-c b-0) (free arm)
   goals met: 0 of 2
36. (eject-base b-0 arm table1)
   deleted: (free arm) (base-present table1) (at b-0 table1)
   added: (hold arm b-0)
   goals met: 0 of 2
37. (move-arm arm table1 table-in)
   deleted: (at arm table1) (arm-present table1)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 2
38. (move-arm arm table-in table-out)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm table-out) (arm-present table-out)
   goals met: 0 of 2
39. (move-arm arm table-out screw-machine-c)
   deleted: (at arm table-out) (arm-present table-out)
   added: (at arm screw-machine-c) (arm-present screw-machine-c)
   goals met: 0 of 2
40. (set-base b-0 arm screw-machine-c)
   deleted: (hold arm b-0)
   added: (at b-0 screw-machine-c) (free arm) (base-present screw-machine-c)
   goals met: 0 of 2
41. (assemble-with-machine b-0 screw-machine-c screw-c attatch-c)
   added: (finished screw-c b-0)
   goals met: 1 of 2
42. (eject-base b-0 arm screw-machine-c)
   deleted: (free arm) (base-present screw-machine-c) (at b-0 screw-machine-c)
   added: (hold arm b-0)
   goals met: 1 of 2
43. (move-arm arm screw-machine-c table-out)
   deleted: (at arm screw-machine-c) (arm-present screw-machine-c)
   added: (at arm table-out) (arm-present table-out)
   goals met: 1 of 2
44. (set-base b-0 arm table-out)
   deleted: (hold arm b-0)
   added: (at b-0 table-out) (free arm) (base-present table-out)
   goals met: 1 of 2
45. (slide-base-out b-0 table-out carry-out)
   deleted: (at b-0 table-out) (base-present table-out)
   added: (at b-0 carry-out)
   goals met: 2 of 2
